{
  "main": {
    "name":"Rob Quinn",
    "occupation":"Pega Certified Senior System Architect (CSSA) - Full Stack Developer",
    "description":"Experienced Application Developer with a demonstrated history of working in the insurance industry. Skilled in Pega PRPC, Full Stack Web Development (HTML5, CSS3, JavaScript, jQuery, Java, Bootstrap, Express.js, React.js, Node.js, SQL), Moble Development, and Test Automation.",
    "image":"profilepic.jpg",
    "bio":"Pega Certified Senior Architect (CSSA) working at Genworth Financial as an Application Developer. Strong background in QA Testing, Test Automation and Automation Frameworks using Selenium.",
    "contactmessage":"Here is where you should write your message to readers to have them get in contact with you.",
    "email": "rob.m.quinn@gmail.com",
    "phone": "804-873-1017",
    "address":{
      "street":"3919 Patterson Ave",
      "city":"Richmond",
      "state":"VA",
      "zip": "23221"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"http://timbakerdev.com",
    "social":[
    
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/rob-quinn/detail/contact-info/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/rquinn1017/",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Here you can create a short write-up of your skills to show off to employers",
    "education":[
      {
        "school":" University of Richmond",
        "degree":"Full Stack Developer Bootcamp",
        "graduated":"April 2020",
        "description":"Learned and applied HTML5, CSS3, JavaScript, jQuery, Java, Bootstrap, Express.js, React.js, Node.js, Database Theory, MongoDB, MySQL, Command Line, Git, and more."
      },
      {
        "school":"University of Richmond",
        "degree":"Bachelor or Arts",
        "graduated":"May 2007",
        "description":"Majored in Rhetoric and Communication Studies and minored in Business Adminstration"
      }
    ],
    "work":[
      {
        "company":"Genworth Financial",
        "title":"Application Developer/Pega Senior System Archtect",
        "years":"June 2018 - Present",
        "description":"Obtained Pega System Achitect (CSA) and Pega Senior System Architect (CSSA) certifications. Develop all aspects of our Customer Service Workflow Applicaiton. Prepared major release files and documentation. Build Soap and Rest service connectors. Configure complex UI requirements. Create case types and flows. Mentored new hire. Supported contractors in troubleshooting application products."
      },
      {
        "company":"Genworth Financial",
        "title":"QA Test Analyst, QA Lead ",
        "years":"Septemper 2016 - May 2018",
        "description":"Oversee onshore and offshore QA resources. Review all test cases written by team members prior to execution. Determine scope and approach for regression automation test bed. Write and execute automated scripts using HP UFT and Selenium to create test data, as well as, for regression testing. Partner with COE to execute Performance Testing. Create and execute functional test cases. Write and execute select, insert, update, and delete SQL statements to create and modify test data using Microsoft SQL Server Management Studio and Oracle SQL Developer."
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"60%"
      },
      {
        "name":"Illustrator",
        "level":"55%"
      },
      {
        "name":"ReactJs",
        "level":"50%"
      },
      {
        "name":"CSS",
        "level":"90%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"VueJs",
        "level":"50%"
      },
      {
        "name":"MongoDB",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Virginia Green",
        "category":"Application that gives eco-friendly tourists the opportunity to connect with eco-friendly businesses",
        "image":"vaGreen.JPG",
        "url":"https://va-green.herokuapp.com/"
      },
      {
        "title":"State of Happiness",
        "category":"Application that allows users to select a state and view a variety of statistics including breweries",
        "image":"stateOfHappiness.JPG",
        "url":"https://baileyrva.github.io/stateofhappiness/"
      },
      {
        "title":"Scruge McDuck",
        "category":"Progressive app using React for keeping debits and credits with our without internet connection",
        "image":"budgetTracker.JPG",
        "url":"https://scrugemcduck.herokuapp.com/"
      },
      {
        "title":"Employee Directory",
        "category":"A React based employee directory",
        "image":"happyBeaver.JPG",
        "url":"https://master.d13s07pv7e2yev.amplifyapp.com/"
      }
    ]
  }
}
